const arrayOfQuotes = [
    {'surah': 'سورة الفتح', 
    'Quranic':'هُوَ الَّذِي أَنزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ لِيَزْدَادُوا إِيمَانًا مَّعَ إِيمَانِهِمْ وَلِلَّـهِ جُنُودُ السَّمَاوَاتِ وَالْأَرْضِ وَكَانَ اللَّـهُ عَلِيمًا حَكِيمً'
    },
    {'surah': 'سورة الرعد', 
     'Quranic': 'الَّذينَ آمَنوا وَتَطمَئِنُّ قُلوبُهُم بِذِكرِ اللَّـهِ أَلا بِذِكرِ اللَّـهِ تَطمَئِنُّ القُلوبُ'
    },
    {'surah': 'سوره فاطر', 
     'Quranic': 'الْحَمْدُ لِلَّـهِ الَّذِي أَذْهَبَ عَنَّا الْحَزَنَ إِنَّ رَبَّنَا لَغَفُورٌ شَكُورٌ'
    },
    {'surah': 'سوره هود', 
     'Quranic': 'إِنّي تَوَكَّلتُ عَلَى اللَّـهِ رَبّي وَرَبِّكُم ما مِن دابَّةٍ إِلّا هُوَ آخِذٌ بِناصِيَتِها إِنَّ رَبّي عَلى صِراطٍ مُستَقيمٍ'
    },
    {'surah': 'سوره الاسراء', 
     'Quranic': 'وَنُنَزِّلُ مِنَ القُرآنِ ما هُوَ شِفاءٌ وَرَحمَةٌ لِلمُؤمِنينَ وَلا يَزيدُ الظّالِمينَ إِلّا خَسارًا'
    },
    {'surah': 'سوره الفاتحه', 
     'Quranic': 'بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ*الْحَمْدُ لِلَّـهِ رَبِّ الْعَالَمِينَ*الرَّحْمَـٰنِ الرَّحِيمِ*مَالِكِ يَوْمِ الدِّينِ*إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ*اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ*صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ'
    },
    {'surah': 'سوره البقره', 
    'Quranic': 'اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ'
   },
   {'surah': 'سوره المؤمنون', 
   'Quranic': 'آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّـهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ*لَا يُكَلِّفُ اللَّـهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ'
  },
];

function generateQuote(){
    const random = Number.parseInt(Math.random()*arrayOfQuotes.length + 1);
    document.querySelector('#Quranic').textContent = `${arrayOfQuotes[random].Quranic}`;
    document.querySelector('#surah').textContent = `${arrayOfQuotes[random].surah}`;
    
}
